In [47]:
import pandas as pd
import numpy as np

__1.Write a Pandas program to create a dataframe from a dictionary and display it.__
Sample data: 

{'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [48]:
dict = {
    'X':[78,85,96,80,86], 
    'Y':[84,94,89,83,86],
    'Z':[86,97,96,72,83]

}
df = pd.DataFrame(dict)
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

__2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.__

In [49]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index = labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

__3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.__

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

__4. Write a Pandas program to get the first 3 rows of a given DataFrame.__

In [51]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [52]:
df.iloc[:3] # позиции индексов

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

__5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.__

In [53]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

__6. Write a Pandas program to select the specified columns and rows from a given data frame.__

Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [54]:
df.iloc[[1,3,5,6], [1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

__7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.__

In [55]:
df[df.attempts>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

__8. Write a Pandas program to count the number of rows and columns of a DataFrame.__

In [56]:
rows, col = df.shape
print(f'Number of Rows: {rows}')
print(f'Number of Columns: {col}')

Number of Rows: 10
Number of Columns: 4

__9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.__

In [57]:
df[df.score.isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

__10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).__

In [58]:
df[df.score.between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

__11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.__

In [59]:
df[(df.attempts<2) & (df.score>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

__12. Write a Pandas program to change the score in row 'd' to 11.5.__

In [60]:
df.loc['d', 'score'] = 11.5 # позиция по айди. при добавлении и других параметров, выбирает конкретный столбец

In [61]:
df.loc['d']

name        James
score        11.5
attempts        3
qualify        no
Name: d, dtype: object

__13. Write a Pandas program to calculate the sum of the examination attempts by the students.__

In [62]:
df.attempts.sum()

19

__14. Write a Pandas program to calculate the mean of all students' scores. Data is stored in a dataframe.__

In [63]:
df.score.mean()

13.333333333333334

__15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original__

In [64]:
df.loc['k'] =['Suresh', 11.5 , 3,  'yes'] # add row
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   11.5         3     yes

In [65]:
df = df.drop('k') # drop by index
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

__16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.__

In [66]:
df.sort_values(by = ['name', 'score'], ascending=[False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

__17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.__

In [67]:
df['qualify'] = df['qualify'].replace(['yes', 'no'], ['True', "False"])
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True

In [68]:
# df['qualify'] = df['qualify'].map({'yes': True, 'no': False})
# df.head(3)

__18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.__

In [70]:
df['name'] = df['name'].replace('James', 'Suresh')
df

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d     Suresh   11.5         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

__19. Write a Pandas program to delete the 'attempts' column from the DataFrame.__

In [71]:
df.drop(columns=['attempts'])

        name  score qualify
a  Anastasia   12.5    True
b       Dima    9.0   False
c  Katherine   16.5    True
d     Suresh   11.5   False
e      Emily    9.0   False
f    Michael   20.0    True
g    Matthew   14.5    True
h      Laura    NaN   False
i      Kevin    8.0   False
j      Jonas   19.0    True

__20. Write a Pandas program to insert a new column in existing DataFrame.__

In [72]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1    True     Red
b       Dima    9.0         3   False    Blue
c  Katherine   16.5         2    True  Orange
d     Suresh   11.5         3   False     Red
e      Emily    9.0         2   False   White
f    Michael   20.0         3    True   White
g    Matthew   14.5         1    True    Blue
h      Laura    NaN         1   False   Green
i      Kevin    8.0         2   False   Green
j      Jonas   19.0         1    True     Red

__21. Write a Pandas program to iterate over rows in a DataFrame.__

In [78]:
exam_data = [{'name':'Anastasia', 'score':12.5}, {'name':'Dima','score':9}, {'name':'Katherine','score':16.5}]

df1  = pd.DataFrame(exam_data)

for index, row in df1.iterrows(): # возвращает итератор строк
    print(row['name'], row['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5

__22. Write a Pandas program to get list from DataFrame column headers.__

In [81]:
df.columns.to_list()

['name', 'score', 'attempts', 'qualify', 'color']

__23. Write a Pandas program to rename columns of a given DataFrame__

In [82]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df2 = pd.DataFrame(d)
df2

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [89]:
df2.columns = ['column1', 'column2', 'column3']
df2

   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

In [85]:
df2 = df2.rename(columns = {'column1': 'Column1'})
df2

   Column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

__24. Write a Pandas program to select rows from a given DataFrame based on values in some columns.__

In [88]:
df2.loc[df2['column2']==4]

   Column1  column2  column3
0        1        4        7

__25. Write a Pandas program to change the order of a DataFrame columns.__

In [90]:
df2 = df2[['column3', 'column2', 'column1']]
df2

   column3  column2  column1
0        7        4        1
1        8        5        2
2        9        6        3

__26. Write a Pandas program to add one row in an existing DataFrame.__

In [121]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df3 = pd.DataFrame(data=d)
print(df3)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [122]:
df3 = pd.concat([df3, df3], ignore_index=True)
df3

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5     1     4     7
6     4     5     8
7     3     6     9
8     4     7     0
9     5     8     1

__27. Write a Pandas program to write a DataFrame to CSV file using tab separator.__

In [123]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df3 = pd.DataFrame(data=d)
df3

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [124]:
df3.to_csv('test.csv', sep = '\t', index = False)
new_df3 = pd.read_csv('test.csv')
new_df3

  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1

__28. Write a Pandas program to count city wise number of people from a given of data set (city, name of the person).__

In [131]:
city = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})

city.groupby(['city']).size().reset_index(name = 'Number of people')

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [139]:
city.groupby(['city']).agg('count').reset_index()

          city  name
0   California     4
1      Georgia     2
2  Los Angeles     4

__29. Write a Pandas program to delete DataFrame row(s) based on given column value.__

In [144]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print(df)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [145]:
df = df.loc[df.col2 != 5]
df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

__30. Write a Pandas program to widen output display to see more columns.__

In [147]:
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

__31. Write a Pandas program to select a row of series/dataframe by given integer__

In [148]:
df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [151]:
df.iloc[[2]]

   col1  col2  col3
3     4     7     0

__32. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.__

In [152]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
print(df)

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [153]:
df = df.fillna(0)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

__33. Write a Pandas program to convert index in a column of the given dataframe.__

In [155]:
df.reset_index(level = 0, inplace = True)
df

   level_0  index       name  score  attempts qualify
0        0      0  Anastasia   12.5         1     yes
1        1      1       Dima    9.0         3      no
2        2      2  Katherine   16.5         2     yes
3        3      3      James    0.0         3      no
4        4      4      Emily    9.0         2      no
5        5      5    Michael   20.0         3     yes
6        6      6    Matthew   14.5         1     yes
7        7      7      Laura    0.0         1      no
8        8      8      Kevin    8.0         2      no
9        9      9      Jonas   19.0         1     yes

In [157]:
print(df.to_string(index = False))

 level_0  index      name  score  attempts qualify
       0      0 Anastasia   12.5         1     yes
       1      1      Dima    9.0         3      no
       2      2 Katherine   16.5         2     yes
       3      3     James    0.0         3      no
       4      4     Emily    9.0         2      no
       5      5   Michael   20.0         3     yes
       6      6   Matthew   14.5         1     yes
       7      7     Laura    0.0         1      no
       8      8     Kevin    8.0         2      no
       9      9     Jonas   19.0         1     yes

__34. Write a Pandas program to set a given value for particular cell in  DataFrame using index value__

In [162]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)

df.at[4, 'score'] = 10 # если нужно получить или установить только одно значение 
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily   10.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [166]:
df.loc[4] = ['Emily', 19, 4, 'no']
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily   19.0         4      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

__35. Write a Pandas program to count the NaN values in one or more columns in DataFrame.__

In [169]:
df.isnull().values.sum()

2